{
  "tr": {
    "title": "Vizyoner Bakış",
    "loading": "Yükleniyor...",
    "home": "Anasayfa",
    "about": "Hakkımızda",
    "services": "Hizmetlerimiz",
    "otherServices": "Diğer Hizmetler",
    "otherServicesTitle": "Diğer Hizmetlerimiz",
    "contact": "İletişim",
    "turkish": "Türkçe",
    "english": "İngilizce",
    "heroTitle": "Vizyoner bakış açısıyla gelişin, dönüşün ve emin adımlarla büyüyün!",
    "heroSubtitle": "25 yıllık deneyimimizle stratejik iş ortağınız olarak yanınızdayız.",
    "heroButton": "Daha Fazla Bilgi",
    "visionTitle": "Vizyonumuz",
    "visionText": "İş ortaklarımızın gelişim ve dönüşümleri için stratejik iş ortağı olarak destek veririz.",
    "purposeTitle": "Amacımız",
    "purposeText": "Stratejik yönetim, kurumsal gelişim ve insan kaynakları alanlarında yenilikçi çözümler sunarak kurum ve kuruluşların geleceğe güçlü adımlarla ilerlemesine rehberlik ederiz.",
    "workModelTitle": "Çalışma Modelimiz",
    "workModelText": "İhtiyaçlarınızı ve beklentilerinizi analitik bakış açısıyla analiz eder, ekosisteminizi ve varmak istediğiniz hedefi ve stratejik amaçları birlikte tespit eder ve yolculuğa başlarız.",
    "valuePropositionTitle": "Değer Önermemiz",
    "valuePropositionItems": [
      "Kurumsal yapınızı stratejik hedeflerle uyumlu hale getirerek verimlilik ve etkinlik artışı sağlıyoruz.",
      "İnsan kaynakları yapınızı stratejik iş ortağına dönüştürerek, performans ve bağlılığı birlikte artırıyoruz.",
      "Başarıyı tesadüfe bırakmadan, hedeflerle hizalanan performans sistemleri kuruyoruz."
    ],
    "servicesTitle": "Hizmetlerimiz",
    "servicesSubtitle": "Stratejik hedeflerinize ulaşmanıza yardımcı olan çözümler",
    "serviceItems": [
      {
        "title": "Strateji Yönetimi Danışmanlığı",
        "description": "Stratejik Yön Belirleme, Ekosistem Analizi, Hedef Belirleme, Hedeflerin Yayılımı",
        "icon": "fa-compass"
      },
      {
        "title": "Kurumsal Performans Yönetimi Danışmanlığı",
        "description": "OKR (Objective Key Results), Balanced Scorecard (Dengelenmiş Kurum Karnesi)",
        "icon": "fa-chart-line"
      },
      {
        "title": "İnsan Kaynakları Danışmanlığı",
        "description": "Yönetici Seçme ve Yerleştirme, 360 Derece Performans Yönetimi, Liderlik Gelişim Programları",
        "icon": "fa-users"
      },
      {
        "title": "Toplam Kalite Yönetimi Danışmanlığı",
        "description": "EFQM Özdeğerlendirme ve EFQM Rehberliği",
        "icon": "fa-award"
      },
      {
        "title": "Süreç Yönetimi Danışmanlığı",
        "description": "Uygun süreç modelinin tasarımı, süreçlerin sahiplendirilmesi, süreçlerin yönetimi",
        "icon": "fa-cogs"
      }
    ],
    "aboutUsTitle": "Hakkımızda",
    "aboutUsDescription": "Vizyoner Bakış Eğitim ve Danışmanlık olarak, kurumların stratejik hedeflerine ulaşmalarına rehberlik eden, sürdürülebilir gelişim ve dönüşüm süreçlerinde güvenilir bir iş ortağı olmayı hedefliyoruz. Her biri kendi alanında uzmanlaşmış eğitmen ve danışman kadromuzla, farklı sektörlerde edindiğimiz geniş deneyimi bir araya getiriyor; her kuruma özel, uygulanabilir ve sonuç odaklı çözümler sunuyoruz.",
    "aboutUsText1": "Ekibimiz; stratejik yönetim, insan kaynakları, kurumsal performans sistemleri, süreç yönetimi, organizasyonel yapılanma, kalite yönetimi ve dijital dönüşüm gibi alanlarda derin bilgi birikimine sahip profesyonellerden oluşmaktadır. Uzmanlarımız, üretimden hizmete, kamu kurumlarından teknoloji şirketlerine kadar pek çok farklı sektörde aktif rol almış, değişim yönetimi, kültürel dönüşüm ve strateji hizalama süreçlerinde liderlik yapmış deneyimli danışmanlardır.",
    "aboutUsText2": "Müşteri odaklı yaklaşımımızla, her kurumun kendi dinamiklerini ve ihtiyaçlarını dikkate alarak özel çözümler geliştiriyoruz. Eğitici ve geliştirici programlarımız, sadece bilgi aktarmayı değil, aynı zamanda kurum içinde kalıcı bir gelişim kültürü oluşturmayı amaçlar.",
    "aboutUsText3": "İleri Bakış olarak biz; sadece bugünün değil, yarının ihtiyaçlarını da gözeten bir bakış açısıyla çalışıyor; kurumları geleceğe taşıyan yapıların kurulmasına destek veriyoruz. Sunduğumuz her hizmet, güçlü analiz, stratejik öngörü ve ölçülebilir sonuç ilkeleriyle şekillenir. Kurumsal gelişiminizi birlikte planlamak, potansiyelinizi performansa dönüştürmek için buradayız.",
    "contactTitle": "İletişim",
    "contactSubtitle": "Bizimle iletişime geçin, projelerinizi konuşalım.",
    "contactInfo": "İletişim Bilgileri",
    "address": "Adres",
    "email": "E-posta",
    "phone": "Telefon",
    "workHours": "Çalışma Saatleri",
    "workHoursValue": "Pazartesi - Cuma: 09:00 - 18:00",
    "sendMessage": "Mesaj Gönderin",
    "name": "İsim",
    "namePlaceholder": "İsminizi giriniz",
    "nameValidation": "İsim alanı zorunludur",
    "phonePlaceholder": "Telefon numaranızı giriniz",
    "phoneValidation": "Telefon alanı zorunludur",
    "emailPlaceholder": "E-posta adresinizi giriniz",
    "emailValidation": "Geçerli bir e-posta adresi giriniz",
    "subject": "Konu",
    "subjectPlaceholder": "Mesaj konunuzu giriniz",
    "subjectValidation": "Konu alanı zorunludur",
    "message": "Mesaj",
    "messagePlaceholder": "Mesajınızı giriniz",
    "messageValidation": "Mesaj alanı zorunludur",
    "sendButton": "Gönder",
    "sending": "Gönderiliyor...",
    "successMessage": "Mesajınız başarıyla gönderildi. En kısa sürede size dönüş yapacağız.",
    "errorMessage": "Mesajınız gönderilirken bir hata oluştu. Lütfen daha sonra tekrar deneyin.",
    "openInGoogleForms": "Google Forms'ta açın"
  },
  "en": {
    "title": "Visionary Perspective",
    "loading": "Loading...",
    "home": "Home",
    "about": "About Us",
    "services": "Our Services",
    "otherServices": "Other Services",
    "otherServicesTitle": "Our Other Services",
    "contact": "Contact",
    "turkish": "Turkish",
    "english": "English",
    "heroTitle": "Grow, transform, and expand with confident steps through a visionary perspective!",
    "heroSubtitle": "We are at your side as your strategic partner with our 25 years of experience.",
    "heroButton": "Learn More",
    "visionTitle": "Our Vision",
    "visionText": "We provide support as a strategic partner for the development and transformation of our business partners.",
    "purposeTitle": "Our Purpose",
    "purposeText": "We guide organizations to move forward with strong steps towards the future by offering innovative solutions in strategic management, corporate development, and human resources.",
    "workModelTitle": "Our Working Model",
    "workModelText": "We analyze your needs and expectations with an analytical perspective, identify your ecosystem, goals, and strategic objectives together, and begin the journey.",
    "valuePropositionTitle": "Our Value Proposition",
    "valuePropositionItems": [
      "We increase efficiency and effectiveness by aligning your corporate structure with strategic goals.",
      "By transforming your human resources structure into a strategic business partner, we increase performance and commitment together.",
      "We establish performance systems aligned with goals without leaving success to chance."
    ],
    "servicesTitle": "Our Services",
    "servicesSubtitle": "Solutions that help you achieve your strategic goals",
    "serviceItems": [
      {
        "title": "Strategic Management Consulting",
        "description": "Strategic Direction Setting, Ecosystem Analysis, Goal Setting, Goal Deployment",
        "icon": "fa-compass"
      },
      {
        "title": "Corporate Performance Management Consulting",
        "description": "OKR (Objective Key Results), Balanced Scorecard",
        "icon": "fa-chart-line"
      },
      {
        "title": "Human Resources Consulting",
        "description": "Executive Selection and Placement, 360 Degree Performance Management, Leadership Development Programs",
        "icon": "fa-users"
      },
      {
        "title": "Total Quality Management Consulting",
        "description": "EFQM Self-Assessment and EFQM Guidance",
        "icon": "fa-award"
      },
      {
        "title": "Process Management Consulting",
        "description": "Design of appropriate process model, process ownership, process management",
        "icon": "fa-cogs"
      }
    ],
    "aboutUsTitle": "About Us",
    "aboutUsDescription": "As Visionary Perspective Training and Consulting, we aim to be a reliable business partner in guiding organizations to achieve their strategic goals and in sustainable development and transformation processes. With our trainers and consultants who are specialized in their fields, we combine our extensive experience from different sectors and offer customized, applicable, and result-oriented solutions for each organization.",
    "aboutUsText1": "Our team consists of professionals with deep knowledge in strategic management, human resources, corporate performance systems, process management, organizational structuring, quality management, and digital transformation. Our experts are experienced consultants who have taken active roles in many different sectors from manufacturing to service, from public institutions to technology companies, and have led change management, cultural transformation, and strategy alignment processes.",
    "aboutUsText2": "With our customer-focused approach, we develop special solutions considering each organization's own dynamics and needs. Our educational and developmental programs aim not only to transfer knowledge but also to create a permanent development culture within the organization.",
    "aboutUsText3": "As Visionary Perspective, we work with a viewpoint that considers not only the needs of today but also tomorrow; we support the establishment of structures that carry organizations to the future. Every service we offer is shaped by the principles of strong analysis, strategic foresight, and measurable results. We are here to plan your corporate development together and transform your potential into performance.",
    "contactTitle": "Contact",
    "contactSubtitle": "Get in touch with us, let's talk about your projects.",
    "contactInfo": "Contact Information",
    "address": "Address",
    "email": "Email",
    "phone": "Phone",
    "workHours": "Working Hours",
    "workHoursValue": "Monday - Friday: 09:00 - 18:00",
    "sendMessage": "Send Message",
    "name": "Name",
    "namePlaceholder": "Enter your name",
    "nameValidation": "Name field is required",
    "phonePlaceholder": "Enter your phone number",
    "phoneValidation": "Phone field is required",
    "emailPlaceholder": "Enter your email address",
    "emailValidation": "Please enter a valid email address",
    "subject": "Subject",
    "subjectPlaceholder": "Enter your message subject",
    "subjectValidation": "Subject field is required",
    "message": "Message",
    "messagePlaceholder": "Enter your message",
    "messageValidation": "Message field is required",
    "sendButton": "Send",
    "sending": "Sending...",
    "successMessage": "Your message has been sent successfully. We will get back to you as soon as possible.",
    "errorMessage": "An error occurred while sending your message. Please try again later.",
    "servicesDescription": "We provide comprehensive consulting and training services in various fields.",
    "service1Title": "Strategic Management Consulting",
    "service1Desc": "Strategic Direction Setting, Ecosystem Analysis, Goal Setting, Goal Deployment",
    "service1Details": "Details",
    "service2Title": "Corporate Performance Management Consulting",
    "service2Desc": "OKR (Objective Key Results), Balanced Scorecard",
    "service2Details": "Details",
    "service3Title": "Human Resources Consulting",
    "service3Desc": "Executive Selection and Placement, 360 Degree Performance Management, Leadership Development Programs",
    "service3Details": "Details",
    "service4Title": "Total Quality Management Consulting",
    "service4Desc": "EFQM Self-Assessment and EFQM Guidance",
    "service4Details": "Details",
    "service5Title": "Process Management Consulting",
    "service5Desc": "Design of appropriate process model, process ownership, process management",
    "service5Details": "Details",
    "openInGoogleForms": "Open in Google Forms"
  }
} 